{
  "dataset": "happiness",
  "display_name": "World Happiness",
  "curve": {
    "scores": [
      32.916666666666664,
      35.0,
      37.916666666666664,
      45.416666666666664,
      45.416666666666664,
      47.5,
      49.583333333333336,
      49.583333333333336,
      50.0,
      50.416666666666664,
      52.5,
      53.333333333333336,
      53.75,
      54.583333333333336,
      54.583333333333336,
      55.0,
      55.416666666666664,
      55.416666666666664,
      55.833333333333336,
      56.25,
      57.083333333333336,
      58.333333333333336,
      59.166666666666664,
      59.583333333333336,
      59.583333333333336,
      59.583333333333336,
      60.0,
      60.416666666666664,
      60.416666666666664,
      61.25,
      62.083333333333336,
      62.083333333333336,
      62.083333333333336,
      62.5,
      62.916666666666664,
      62.916666666666664,
      62.916666666666664,
      63.75,
      63.75,
      64.16666666666667,
      64.16666666666667,
      64.16666666666667,
      64.58333333333333,
      64.58333333333333,
      64.58333333333333,
      64.58333333333333,
      65.0,
      65.0,
      65.41666666666667,
      65.41666666666667,
      65.41666666666667,
      65.83333333333333,
      65.83333333333333,
      65.83333333333333,
      65.83333333333333,
      65.83333333333333,
      66.25,
      66.66666666666667,
      66.66666666666667,
      66.66666666666667,
      67.08333333333333,
      67.08333333333333,
      67.5,
      67.5,
      67.5,
      67.5,
      67.91666666666667,
      67.91666666666667,
      67.91666666666667,
      68.33333333333333,
      68.33333333333333,
      68.33333333333333,
      68.33333333333333,
      68.33333333333333,
      68.75,
      68.75,
      68.75,
      68.75,
      68.75,
      68.75,
      69.16666666666667,
      69.16666666666667,
      69.16666666666667,
      69.16666666666667,
      69.16666666666667,
      69.16666666666667,
      69.16666666666667,
      69.16666666666667,
      69.16666666666667,
      69.16666666666667,
      69.58333333333333,
      69.58333333333333,
      69.58333333333333,
      69.58333333333333,
      69.58333333333333,
      69.58333333333333,
      69.58333333333333,
      69.58333333333333,
      70.0,
      70.0,
      70.0,
      70.0,
      70.0,
      70.0,
      70.0,
      70.41666666666667,
      70.41666666666667,
      70.41666666666667,
      70.41666666666667,
      70.41666666666667,
      70.41666666666667,
      70.41666666666667,
      70.41666666666667,
      70.41666666666667,
      70.41666666666667,
      70.41666666666667,
      70.41666666666667,
      70.83333333333333,
      70.83333333333333,
      70.83333333333333,
      70.83333333333333,
      70.83333333333333,
      71.25,
      71.25,
      71.25,
      71.25,
      71.25,
      71.25,
      71.25,
      71.25,
      71.66666666666667,
      71.66666666666667,
      71.66666666666667,
      71.66666666666667,
      71.66666666666667,
      71.66666666666667,
      72.08333333333333,
      72.08333333333333,
      72.08333333333333,
      72.08333333333333,
      72.08333333333333,
      72.08333333333333,
      72.5,
      72.5,
      72.5,
      72.5,
      72.5,
      72.5,
      72.5,
      72.5,
      72.5,
      72.5,
      72.5,
      72.91666666666667,
      72.91666666666667,
      72.91666666666667,
      72.91666666666667,
      72.91666666666667,
      72.91666666666667,
      73.33333333333333,
      73.33333333333333,
      73.33333333333333,
      73.33333333333333,
      73.75,
      73.75,
      73.75,
      73.75,
      73.75,
      73.75,
      74.16666666666667,
      74.16666666666667,
      74.16666666666667,
      74.16666666666667,
      74.16666666666667,
      74.16666666666667,
      74.16666666666667,
      74.16666666666667,
      74.58333333333333,
      74.58333333333333,
      74.58333333333333,
      74.58333333333333,
      75.0,
      75.0,
      75.0,
      75.0,
      75.0,
      75.0,
      75.0,
      75.0,
      75.0,
      75.0,
      75.0,
      75.41666666666667,
      75.41666666666667,
      75.83333333333333,
      75.83333333333333,
      75.83333333333333,
      76.25,
      76.25,
      76.25,
      76.25,
      76.25,
      76.25,
      76.25,
      76.25,
      76.25,
      76.66666666666667,
      76.66666666666667,
      76.66666666666667,
      76.66666666666667,
      76.66666666666667,
      77.08333333333333,
      77.08333333333333,
      77.08333333333333,
      77.08333333333333,
      77.5,
      77.5,
      77.5,
      77.91666666666667,
      77.91666666666667,
      77.91666666666667,
      77.91666666666667,
      77.91666666666667,
      78.33333333333333,
      78.33333333333333,
      78.33333333333333,
      78.33333333333333,
      78.75,
      78.75,
      78.75,
      78.75,
      79.16666666666667,
      79.16666666666667,
      79.16666666666667,
      79.16666666666667,
      79.16666666666667,
      79.58333333333333,
      79.58333333333333,
      80.0,
      80.0,
      80.41666666666667,
      80.41666666666667,
      80.41666666666667,
      80.41666666666667,
      80.83333333333333,
      80.83333333333333,
      81.25,
      81.25,
      82.08333333333333,
      82.5,
      83.33333333333333,
      84.16666666666667,
      84.16666666666667,
      84.58333333333333,
      85.41666666666667
    ],
    "total_count": 255,
    "avg_score": 70.18300653594771,
    "min_score": 32.916666666666664,
    "max_score": 85.41666666666667
  },
  "samples": [
    {
      "index": 0,
      "score": 32.92,
      "insight": "A noticeable trend emerges in 'Life Ladder,' where all countries show comparable performance (~10), indicating a relatively uniform global perception of life satisfaction. This similarity might reflect common societal expectations regarding quality of life or a shared human experience of life satisfaction regardless of economic differences. Policymakers globally could use this as a benchmark for assessing broader social goals and determining strategies to maintain or enhance life satisfaction levels.",
      "img_url": "img/interactive_happiness/sample_0.png",
      "run_name": "run_01_meta_4"
    },
    {
      "index": 10,
      "score": 52.5,
      "insight": "In contrast to Japan, several countries like Madagascar and Morocco present inverted patterns, where negative affect scores dominate over positive affect scores, albeit with smaller margins compared to extreme cases like Venezuela. For Madagascar, the negative affect score is around 0.5, while the positive affect score is just above 0.3. These inverted trends suggest potential underlying economic or infrastructural challenges that require attention. Development agencies working in such regions could focus on addressing basic necessities, infrastructure development, or improving access to resources to alleviate these negative sentiments. Efforts should aim to reverse these trends within the next 3-5 years by implementing localized programs tailored to each country's specific needs.",
      "img_url": "img/interactive_happiness/sample_1.png",
      "run_name": "run_02_meta_2"
    },
    {
      "index": 20,
      "score": 57.08,
      "insight": "The chart shows that the highest growth rate was recorded in the early period of 2005, reaching over 10.0 in mean log GDP per capita, whereas the more recent years (post-2020) exhibit lower and more volatile growth rates. This divergence suggests that while earlier periods experienced stronger economic expansion, possibly fueled by unique factors like industrialization or demographic booms, later periods faced constraints such as aging populations, rising inequality, or increased competition globally. Policy interventions aimed at addressing current challenges (e.g., innovation, workforce skills development) are essential to reignite the robust growth seen earlier.",
      "img_url": "img/interactive_happiness/sample_2.png",
      "run_name": "run_01_meta_4"
    },
    {
      "index": 30,
      "score": 62.08,
      "insight": "Denmark demonstrates consistently higher performance across most key indicators compared to other countries, suggesting a well-rounded societal development. This is particularly evident in 'Healthy Life Expectancy At Birth,' where Denmark scores near the top range of the scale (~70). This performance likely reflects robust healthcare systems and social policies, as evidenced by its leading position in 'Social Support' (~40). This advantage may influence policy decisions in other countries seeking to improve their overall societal health metrics.",
      "img_url": "img/interactive_happiness/sample_3.png",
      "run_name": "run_01_meta_4"
    },
    {
      "index": 40,
      "score": 64.17,
      "insight": "The near-symmetry of the distribution around the central peak suggests a balanced range of dissatisfaction and over-satisfaction relative to the median score. However, the slightly flatter right tail hints at a possible slight skew toward higher satisfaction. This asymmetry, though minor, could imply that individuals are more likely to experience incremental increases in satisfaction than profound decreases. For organizations assessing public well-being, understanding this slight positive lean could guide efforts towards enhancing satisfaction rather than solely mitigating dissatisfaction, potentially by focusing on scalable improvements in areas like quality of life or access to resources.",
      "img_url": "img/interactive_happiness/sample_4.png",
      "run_name": "run_03_meta_4"
    },
    {
      "index": 50,
      "score": 65.42,
      "insight": "The sentiment analysis reveals that countries such as Venezuela, Zimbabwe, and Syria consistently exhibit higher negative affect scores compared to positive affect scores across the board. This indicates a predominantly negative emotional outlook within these nations. Venezuela's negative affect score hovers around 0.8, substantially higher than its positive affect score, which remains below 0.2. The sharp contrast between these two metrics suggests underlying socio-economic issues or political unrest influencing public sentiment. Policymakers in these countries may consider focusing on initiatives aimed at improving transparency and stability to enhance overall national sentiment, targeting areas like economic reforms or public safety programs over the next fiscal year.",
      "img_url": "img/interactive_happiness/sample_5.png",
      "run_name": "run_02_meta_2"
    },
    {
      "index": 60,
      "score": 67.08,
      "insight": "The box plot reveals that the lower bound of the IQR is quite close to the lower whisker, suggesting that there is limited variability in scores below the median. In contrast, the upper part of the distribution shows a wider spread. This could imply that while there are fewer respondents experiencing significantly low life satisfaction, there is more diversity in how those who feel relatively satisfied perceive their lives. Understanding the reasons behind this divergence—such as economic stability, social support, or personal achievement—could help tailor programs that maintain positive life satisfaction while uplifting those who are less content.",
      "img_url": "img/interactive_happiness/sample_6.png",
      "run_name": "run_02_meta_1"
    },
    {
      "index": 70,
      "score": 68.33,
      "insight": "The overall disparity in peak frequencies between Positive and Negative Affect highlights a broader societal or psychological trend favoring positivity at higher affect scores. The peak frequency for Positive Affect exceeds that of Negative Affect by approximately 20%, with respective peaks reaching around 280 and 300. This consistent gap suggests a potential bias or inclination towards reporting or experiencing positive emotions more intensely than negatives in favorable conditions. Policymakers aiming to enhance community well-being could leverage this trend by reinforcing activities or environments known to promote positive emotions, such as social engagement, nature exposure, or creative outlets. By aligning interventions with existing positive tendencies, they may amplify their impact effectively. Key performance indicators could include tracking shifts in the average affect score over time, aiming to elevate it steadily over a one-to-two-year period as part of their well-being strategy.",
      "img_url": "img/interactive_happiness/sample_7.png",
      "run_name": "run_02_meta_5"
    },
    {
      "index": 80,
      "score": 69.17,
      "insight": "The lower-left cluster of data points, where both corruption perceptions are low and confidence is high, suggests that countries or regions experiencing minimal corruption enjoy significantly higher trust in their governments. These clusters represent an ideal scenario for policy makers, illustrating the potential benefits of maintaining low corruption levels. This insight emphasizes the long-term importance of proactive measures to prevent corruption rather than reacting to high corruption rates, as prevention appears to sustain public trust more effectively. Governments with low corruption should prioritize sustaining these conditions and could serve as benchmarks for others struggling with declining trust.",
      "img_url": "img/interactive_happiness/sample_8.png",
      "run_name": "run_01_meta_2"
    },
    {
      "index": 90,
      "score": 69.58,
      "insight": "The United States displays an uneven performance profile, excelling in 'Generosity' but lagging behind in 'Social Support.' This juxtaposition may reflect a complex interplay between cultural norms and social safety nets. While 'Generosity' (~55) suggests a high level of altruism, the comparatively low score in 'Social Support' (~10) could highlight deficiencies in collective social structures. Policymakers might explore initiatives that bridge this gap, potentially through investments in community-driven support programs.",
      "img_url": "img/interactive_happiness/sample_9.png",
      "run_name": "run_01_meta_4"
    },
    {
      "index": 100,
      "score": 70.0,
      "insight": "Comparing the three distributions, we observe different central tendencies and spread patterns. While 'Life Ladder' demonstrates a balanced normal distribution, 'Log GDP Per Capita' skews toward higher values, and 'Social Support' has a highly concentrated peak. These contrasting patterns suggest diverse underlying factors influencing each metric. For instance, GDP per capita's positive skew may reflect systemic global inequalities in economic development, whereas the robust concentration in Social Support hints at cultural or societal norms favoring community engagement. This implies that improving life satisfaction may require addressing broader economic conditions alongside strengthening social connections. A potential action would be to integrate economic development strategies with community-building initiatives to holistically enhance overall well-being.",
      "img_url": "img/interactive_happiness/sample_10.png",
      "run_name": "run_02_meta_3"
    },
    {
      "index": 110,
      "score": 70.42,
      "insight": "South Asia experiences noticeable volatility in its healthy life expectancy trend, likely reflecting internal variations or external shocks. The pink dashed line displays significant fluctuations, particularly between 2005 and 2015, before stabilizing slightly. Despite these fluctuations, South Asia's healthy life expectancy increases from approximately 55 years to around 60 years by 2022.5. This inconsistent progress suggests challenges like inequitable access to healthcare or environmental factors. Policymakers in South Asia may focus on implementing targeted interventions to address these fluctuations, such as expanding rural healthcare services and improving sanitation, aiming to achieve steady growth over the next 5-7 years.",
      "img_url": "img/interactive_happiness/sample_11.png",
      "run_name": "run_02_meta_2"
    },
    {
      "index": 120,
      "score": 70.83,
      "insight": "The median being slightly above 5 implies that, overall, respondents tend to lean toward moderately positive life satisfaction ratings. However, the presence of a significant outlier at 1 suggests that despite the general trend, individual circumstances play a critical role in shaping perceptions of life satisfaction. This insight raises the question of whether targeted interventions aimed at supporting those with lower scores could help lift their satisfaction closer to the median, thereby reducing the skew in the distribution and improving societal averages. Policymakers or community leaders might consider addressing the specific needs or challenges faced by those with extremely low scores.",
      "img_url": "img/interactive_happiness/sample_12.png",
      "run_name": "run_02_meta_1"
    },
    {
      "index": 130,
      "score": 71.67,
      "insight": "There is a notable asymmetry in the distribution, with the peak near '5' being sharper and higher compared to the secondary peak below '7'. This asymmetry suggests that while both peaks represent significant groups, the moderate satisfaction cluster is numerically larger and perhaps more homogeneous. The sharpness of the '5' peak could indicate a consensus or normalization of moderate satisfaction as a societal average, whereas the flatter secondary peak below '7' may suggest a more diverse set of experiences among the highly satisfied. Policymakers and community leaders should focus on understanding the factors contributing to this asymmetry, possibly through surveys or qualitative research, to design interventions that amplify positive influences on satisfaction. For example, insights gained could guide initiatives aimed at reducing the disparity in satisfaction levels, targeting a 10-20% shift of the '5' cluster towards the higher satisfaction range over a two-year period.",
      "img_url": "img/interactive_happiness/sample_13.png",
      "run_name": "run_01_meta_1"
    },
    {
      "index": 140,
      "score": 72.08,
      "insight": "'Log GDP Per Capita' exhibits a moderate positive contribution to life satisfaction, suggesting that economic prosperity does play a role but is not as significant as health. While the second-highest bar at approximately 10 units indicates an influence, it is substantially less impactful than healthy life expectancy. This finding implies that while improving economic conditions is beneficial, it may not address fundamental determinants of happiness as effectively as enhancing health outcomes. Policymakers should consider balancing economic development strategies with health-focused interventions to optimize overall societal well-being. Additionally, this insight suggests that while wealthier countries might have higher life satisfaction due to economic factors, health outcomes remain a stronger driver of contentment.",
      "img_url": "img/interactive_happiness/sample_14.png",
      "run_name": "run_03_meta_2"
    },
    {
      "index": 150,
      "score": 72.5,
      "insight": "The concentration of frequencies between 4 and 6 represents approximately 70-80% of the total sample, forming a plateau-like cluster. This banding effect indicates that the majority of respondents situate their life satisfaction within a narrow range of moderately positive outcomes. Such homogeneity might reflect systemic social influences or shared environmental factors that lead to similar evaluations across different groups. Understanding what factors contribute to this clustered evaluation zone is critical for designing effective programs aimed at broad-scale improvement. Public health or community engagement initiatives targeting this central band could achieve maximum impact.",
      "img_url": "img/interactive_happiness/sample_15.png",
      "run_name": "run_03_meta_4"
    },
    {
      "index": 160,
      "score": 73.33,
      "insight": "High GDP per capita does not guarantee uniformly high life satisfaction, as evidenced by the clustering of points with varying life satisfaction scores at the upper end of the GDP spectrum. This suggests that while wealth is a contributing factor to happiness, it is neither a sufficient nor necessary condition for achieving high life satisfaction. Other potential explanatory variables, such as inequality, environmental quality, or community engagement, may counteract the positive effects of economic prosperity. Policymakers aiming to boost life satisfaction in wealthy nations might explore redistributive measures or investments in public goods to address these additional factors and ensure equitable access to sources of happiness.",
      "img_url": "img/interactive_happiness/sample_16.png",
      "run_name": "run_02_meta_1"
    },
    {
      "index": 170,
      "score": 74.17,
      "insight": "The distribution of global happiness scores follows a bell-shaped curve, indicating that most countries have happiness scores clustered around the midpoint of the scale. This suggests that there may be an underlying equilibrium or balance in factors contributing to happiness across the globe. Countries with extremely high or low scores are less common, as evidenced by the tapered tails of the distribution. The peak frequency is centered around a happiness score of approximately 6, where roughly 250 countries fall, highlighting this as the modal range. This central clustering likely reflects shared socio-economic and political conditions across many nations, though further investigation is needed to identify these specific factors. Policymakers could focus resources on countries scoring below the modal range to address underlying issues affecting happiness, aiming to shift the overall distribution slightly to the right over time.",
      "img_url": "img/interactive_happiness/sample_17.png",
      "run_name": "run_01_meta_5"
    },
    {
      "index": 180,
      "score": 74.58,
      "insight": "The Middle East and North Africa exhibit a relatively high Life Ladder Score (~5.42) compared to neighboring regions like South Asia and Southeast Asia. This disparity suggests that despite geopolitical tensions and economic volatility, the region may have some mitigating factors like relatively stable governance or strategic resource allocation contributing to higher life satisfaction. For example, investments in renewable energy or digital infrastructure could potentially further enhance the regional well-being. Focusing on reducing regional disparities through targeted development programs could raise the Life Ladder Score by ~0.3 points over the next seven years.",
      "img_url": "img/interactive_happiness/sample_18.png",
      "run_name": "run_03_meta_4"
    },
    {
      "index": 190,
      "score": 75.0,
      "insight": "The distribution of Positive Affect is significantly right-skewed compared to Negative Affect. This suggests that individuals generally experience a higher frequency of positive emotional states towards the higher end of the affect score scale. Specifically, the Positive Affect peaks around the 0.7 range with frequencies over 280, whileNegative Affect peaks between 0.2 and 0.3 but drops off sharply at higher scores. This divergence in peak frequencies indicates that positive emotions are more prevalent among participants who exhibit higher affect scores, whereas negative emotions are more frequent in lower scoring ranges. This trend could imply a correlation between higher affect scores and increased happiness or satisfaction, though further investigation is needed to confirm causation. Stakeholders in mental health or well-being programs may consider designing interventions targeting the mid-range of negative affect scores (around 0.2–0.3) where the highest concentration of negative responses exists, aiming to shift these scores toward the positive range over time.",
      "img_url": "img/interactive_happiness/sample_19.png",
      "run_name": "run_02_meta_5"
    },
    {
      "index": 200,
      "score": 76.25,
      "insight": "The scatter plot reveals a positive correlation between Log GDP Per Capita and Life Ladder scores, indicating that higher economic prosperity is associated with increased life satisfaction. The trend line shows a consistent upward slope, suggesting that as countries experience economic growth, their populations tend to report higher levels of happiness. However, the degree of improvement in life satisfaction diminishes as GDP per capita increases further, which could imply diminishing marginal returns on happiness beyond a certain economic threshold. This pattern is evident in the widening spread of data points at higher GDP levels, where the rate of increase in life satisfaction slows despite rising wealth. Policymakers may consider focusing on factors beyond economic growth, such as social well-being and cultural drivers, to further enhance life satisfaction in affluent societies.",
      "img_url": "img/interactive_happiness/sample_20.png",
      "run_name": "run_02_meta_1"
    },
    {
      "index": 210,
      "score": 76.67,
      "insight": "The Commonwealth of Independent States demonstrates contrasting performances between social support and freedom to make life choices. While social support has a relatively high median value and minimal variability, freedom to make life choices exhibits a much lower median and considerable spread in its interquartile range. This discrepancy suggests that although community support systems may be well-established, there could be restrictions or barriers hindering individual autonomy. Governments in this region might benefit from targeted interventions to improve policies that enhance personal freedom, while potentially leveraging existing social support structures as a foundation for these reforms.",
      "img_url": "img/interactive_happiness/sample_21.png",
      "run_name": "run_03_meta_5"
    },
    {
      "index": 220,
      "score": 77.92,
      "insight": "There is a positive correlation between economic prosperity (measured by Log GDP Per Capita) and well-being (measured by Life Ladder). The red trendline shows that as Log GDP Per Capita increases, Life Ladder scores tend to rise, indicating higher levels of reported happiness or satisfaction. This relationship appears to be linear, suggesting that economic growth likely contributes to enhanced individual well-being. However, there is significant variability around this trend, especially at lower levels of GDP per capita, where the spread of Life Ladder scores is wider. This suggests that other factors, such as social policies or cultural context, may play a stronger role in determining well-being in less prosperous nations. Policymakers in developing economies should consider addressing these additional determinants of well-being alongside economic growth strategies to maximize overall societal happiness.",
      "img_url": "img/interactive_happiness/sample_22.png",
      "run_name": "run_02_meta_2"
    },
    {
      "index": 230,
      "score": 78.75,
      "insight": "There is a noticeable gap between North America and ANZ and other regions in terms of social support, but their freedom to make life choices appears more comparable to regions like Latin America and the Caribbean. North America and ANZ maintain high median values for both indicators, though social support remains slightly higher. This could suggest a strong emphasis on societal inclusiveness and collaboration in this region. However, the similarity in freedom levels to Latin America and the Caribbean, where social support is lower, raises questions about whether these freedoms are being exercised within stable, supportive environments. Policy initiatives in North America and ANZ might explore how to strengthen social safety nets further without compromising personal freedoms.",
      "img_url": "img/interactive_happiness/sample_23.png",
      "run_name": "run_03_meta_5"
    },
    {
      "index": 240,
      "score": 80.42,
      "insight": "There is a noticeable pattern where indicators like 'Social Support,' 'Healthy Life Expectancy At Birth,' and 'Freedom To Make Life Choices' exhibit moderate to strong positive correlations with each other, ranging from 0.41 to 0.82. This clustering suggests that these factors tend to coexist and reinforce one another in societies. For instance, higher 'Social Support' is likely to accompany longer 'Healthy Life Expectancy At Birth,' possibly due to better healthcare systems or societal cohesion. Similarly, 'Freedom To Make Life Choices' shows moderate correlation with most indicators, implying that societies where individuals have more freedom might also enjoy better social and health conditions. Policy makers may consider holistic approaches that address multiple dimensions of well-being rather than focusing on singular aspects to maximize societal benefits across these interlinked areas.",
      "img_url": "img/interactive_happiness/sample_24.png",
      "run_name": "run_01_meta_2"
    },
    {
      "index": 250,
      "score": 83.33,
      "insight": "There appears to be a diminishing marginal return effect of GDP on happiness as we move to higher GDP per capita levels. While the red regression line shows a positive correlation, the slope begins to flatten as the Log GDP Per Capita increases toward the right end of the x-axis. This implies that while economic growth significantly enhances happiness initially, its impact plateaus at higher GDP levels. This observation aligns with the concept of the 'Easterlin Paradox,' which posits that beyond a certain level of affluence, further economic gains do not substantially improve subjective well-being. Policymakers targeting happiness maximization should focus on ensuring equitable distribution of wealth rather than solely pursuing economic growth once a country reaches a certain prosperity threshold. For example, redistributive policies and investments in social services may yield better results in enhancing happiness compared to further GDP-driven strategies.",
      "img_url": "img/interactive_happiness/sample_25.png",
      "run_name": "run_02_meta_5"
    },
    {
      "index": 254,
      "score": 85.42,
      "insight": "A striking feature of the heatmap is the near-zero correlation between 'Log GDP Per Capita' and 'Generosity' (-0.00), suggesting that higher income levels do not strongly influence generosity. This finding contrasts with common assumptions that greater wealth might lead to more charitable behavior. Instead, factors such as cultural norms, education, or other non-economic drivers may play a more critical role in fostering generosity. Public campaigns aimed at increasing generosity might benefit from focusing on non-material incentives or creating narratives around the value of giving rather than expecting increased wealth to naturally lead to more charitable actions.",
      "img_url": "img/interactive_happiness/sample_26.png",
      "run_name": "run_01_meta_2"
    }
  ],
  "interval": 10
}